    
      function searchWordsInText(text, fullMatchWords, partialMatchWords) {
            var foundWords = [];

            // Поиск слов с полным соответствием
            for (var i = 0; i < fullMatchWords.length; i++) {
              var lowercaseWord = fullMatchWords[i].toLowerCase();

              if (new RegExp("\\b" + lowercaseWord + "\\b", "i").test(text)) {
                //foundWords.push(fullMatchWords[i]);
                return false
              }
            }

            // Поиск слов с неполным соответствием
            for (var j = 0; j < partialMatchWords.length; j++) {
              var lowercasePartialWord = partialMatchWords[j].toLowerCase();

              if (text.toLowerCase().includes(lowercasePartialWord) && foundWords.indexOf(partialMatchWords[j]) === -1) {
                //foundWords.push(partialMatchWords[j]);
                return false
              }
            }

            //return foundWords;
            return true;
          }
      var Brandsafety = null
      // Получение текста статьи по её ID и вызов функции поиска
      var articleText = document.querySelector(".ProseMirror-view");
      if(articleText != null){
        // Список слов, которые вы ищете
        var partialMatchWords = ["камасутр","погибш","лезби","наркоторговц","окровавлен","искровав","траур","холоднокровн","трансгендер","мочеполов","вич-инфекц","убийца","порнофильм","психопат","ебать","сыноубийство","похороны","транссексуал","самоубийственный","избить","больница","отравил","погиб","мертвятин","выеб","утонул","умерший","порнограф","марихуа","утонули","крушение","порнографический","наркоман","террорист","говно","зарезали","презерватива","мочевин","суицидальн","похоронила","обескровлива","мочевыделен","отравлен","гибнуть","взрыв","наркомания","выебон","порноактриса","конопляный","генитальный","порнух","давалка","трагическая","наркотизатор","траурный","развратный","кровопускательн","порнушка","чадоубийца","сектант","групповуха","потерпевший","девственый","трагический","трагедия","мочеизнурен","ебля","усопший","расчлененка","матереубийца","презерватив","мужеубийство","детоубийство","минет","экстремизм","казнь","окровавлива","анус","менструация","суицид","детоубийца","вибратор","расстреля","расстреляли","терроризм","шмал","заложник","порнопродюсер","венерические","спид","больной","пизда","кокаином","умертв","изнасиловали","цареубийца","скончался","отравленный","братоубийство","гандон","выебывать","порнография","братоубийца","вьебать","травматическ","мертвя","преступниц","самоубийца","отцеубийство","некрофил","порноиндустрия","мертвоед","заминировать","хоронили","сектантский","удушил","марихуана","мочев","погибнет","гомосексуалист","эвакуировали","кастрац","фигурант","насилует","теракт","инцест","выебать","анилингус","убийство","лесби","стрельба","матереубийство","матка","анекдот","пожар","мочеистощен","сестроубийца","онанизм","мочеиспускан","оргазм","кровохарка","наркоманка","мочильн","конопля","наркотики","бздун","убитый","кладбище","молочница","женоубийца","обескровливан","соболезную","трансексуал","женоубийство","вич-инфекция","сумасшедш","влагалищ","погиб","лихорад","презерват","кровищ","вагина","насилие","братоубийственный","кража","ядовитый","кровопролит","умерщвлен","дрочка","дрочить","совращение","смертельный","избили","жертва","мочеиспускательн","сифилис","гибнет","порноактер","тюремн","алкоголь","порнозвезд","отрава","моча","еблант","окровав","генитал","доебать","альцгеймер","бздеть","поминать","застрелил","лезбиянки","человекоубийство","кровавый","смертник","землятресение","вагинит","гнида","кровосмесительств","гомосексуал","избитого","говнюк","казнил","ананизм","криминальный","сношаются","миссионерск","наркотизирова","хищение","вагинизм","разврат","вагинальн","бдсм","влагалищное","обескров","маньяк","гибнут","психотропные","проституток","скончалась","убийствам","террористический","мочеотделен","сношение","вульв","долбоеб","наркотизм","травмированный","месячные","марива","герпес","труп","соболезнование","цареубийство","погребальный","похоть","драка","мочеотделительн","смертоубийство","ебет","лесбиянка","смертниц","убийственный","траурн","гибель","педофил","смертный","обескровет","смертоубийственный","изнасилование","наркотик","избиение","изнасиловал","расправился","самоубийство","гепатит","ахуевать","доебывать","погибнуть","перестрелка","изнасилован","отравление","трахатьс","раненный","сыноубийца","умерли","наркотизац","расправа","гомосексуализм","мочеточник","избившего","умерщвля","мочекров","аминг-аут","гомофоб","бисекс","однопол","ЛГБТ","домогат","мошенн","дискримин","злоумышленн","национализм","возгоран","землятрясен","ухудш","войн","украин","днр","лнр","донецк","луганск","харьков","Донецк","Путин","Зеленский","Байден","армия","миноборон","президент","санкции","нацист","мобилизац","войск","солдат","Донбасс","Крым","Киев","Кремл","Украина","лднр","демобилизац","денационализац","вторжен","росавиация","демилитаризац","милитаризац"]
        var fullMatchWords = ["кончина","тюрьма","преступник","говенный","отцеубийца","проститутка","проститутка","транс","порно","криминал","блядство","шизофрения","покушение","погребение","блядь","дефлорация","анальный","блядский","уголовное","человекоубийца","насмерть","мужеубийца","растление","побои","рак", "секс"];
        var articleTextInnerText = articleText.innerText
        var Brandsafety = searchWordsInText(articleTextInnerText, fullMatchWords, partialMatchWords);
        console.log('Brandsafety='+ Brandsafety)
      }
    
    